lua/doc/README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Lua RTT bindings (beta1)</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-09-13 Mon"/>
<meta name="author" content="Markus Klotzbuecher"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content">

<h1 class="title">Lua RTT bindings (beta1)</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Overview </a></li>
<li><a href="#sec-2">2 Setup </a>
<ul>
<li><a href="#sec-2_1">2.1 Compilation </a></li>
<li><a href="#sec-2_2">2.2 Runtime </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Quickstart </a></li>
<li><a href="#sec-4">4 Lua API </a>
<ul>
<li><a href="#sec-4_1">4.1 Overview </a></li>
<li><a href="#sec-4_2">4.2 <code>TaskContext</code> </a></li>
<li><a href="#sec-4_3">4.3 <code>Variable</code> </a></li>
<li><a href="#sec-4_4">4.4 <code>InputPort</code> and <code>OutputPort</code> </a></li>
</ul>
</li>
<li><a href="#sec-5">5 Pitfalls </a></li>
<li><a href="#sec-6">6 The <code>rttlib</code> convenience module </a></li>
<li><a href="#sec-7">7 Tips and tricks </a>
<ul>
<li><a href="#sec-7_1">7.1 Using functions instead of methods </a></li>
<li><a href="#sec-7_2">7.2 rttlua init file <code>~/.rttlua</code> </a></li>
</ul>
</li>
<li><a href="#sec-8">8 Known issues </a></li>
<li><a href="#sec-9">9 Todo  </a>
<ul>
<li><a href="#sec-9_1">9.1 reintegrate tlsf </a></li>
<li><a href="#sec-9_2">9.2 hard-real </a></li>
</ul>
</li>
<li><a href="#sec-10">10 License </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview </h2>
<div class="outline-text-2" id="text-1">


<p>
The RTT Lua bindings provide a slim but powerful interface to the
RTT framework. These bindings can be used in three different ways:
</p>
<ol>
<li>
As <b>RTT enabled Lua interpreter</b>

<p>
This is the easiest way to test a script and see if it works or
for use as a scriptable deployer.
</p>
</li>
<li>
As a <b>Lua component</b>

<p>
A Lua component which offers two operations. The first for
executing a given lua script and the second for executing a
string with lua code.
</p>
</li>
<li>
As a <b>RTT plugin</b>

<p>
A <i>Lua Service</i> can be loaded into a component and used e.g. for
<i>intra-component</i> coordination. It offers the same API as the
Lua component.
</p>
</li>
</ol>

<p>The Lua API consists of objects and free functions. The API naming
mostly follows that RTT while simplifying where possible.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Setup </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Compilation </h3>
<div class="outline-text-3" id="text-2_1">


<ul>
<li>
requires Lua-5.1 (debian: liblua5.1-0-dev, liblua5.1-0, lua5.1)

</li>
</ul>
</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> Runtime </h3>
<div class="outline-text-3" id="text-2_2">


<ul>
<li>
setup <code>LUA_PATH</code> and <code>LUA_CPATH</code> so that the necessary modules
are found. The former is for lua modules (.lua) and the later is
for binary ones (.so). For example:


</li>
</ul>


<pre class="example">$ export LUA_PATH=";;;/usr/share/lua/5.1/?.lua;\
        /usr/share/lua/5.1/?/init.lua;\
        /home/mk/src/git/orocos/ocl/lua/lua-modules/?.lua"
</pre>



<ul>
<li>
if using <code>rttlua</code> scripting: export correct <code>RTT_COMPONENT_PATH</code>
variable, e.g.


</li>
</ul>


<pre class="example">$ export RTT_COMPONENT_PATH=/home/mk/tmp/rtt-2.0/lib/orocos:home/mk/src/git/ocl/lua
</pre>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Quickstart </h2>
<div class="outline-text-2" id="text-3">


<p>
Run the <code>rttlua</code> interpreter:
</p>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Lua API </h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> Overview </h3>
<div class="outline-text-3" id="text-4_1">


<p>
All rtt related functions are stored in a global table called
<code>rtt</code>. They are further subdivided as followed:
</p>
<ul>
<li>
<code>TaskContext</code>
</li>
<li>
<code>Variable</code>
</li>
<li>
<code>InputPort</code> and <code>OutputPort</code>
</li>
<li>
<code>Property</code>
</li>
<li>
<code>SendHandle</code>
</li>
<li>
<code>Service</code>
</li>
<li>
<code>Operation</code>
</li>
<li>
<code>Logger</code>

<p>
The flag column describes different properties of a function/method:
</p><ul>
<li>
<code>RT</code>: real-time safe
</li>
<li>
<code>GC</code>: garbage collected object


</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2"><span class="section-number-3">4.2</span> <code>TaskContext</code> </h3>
<div class="outline-text-3" id="text-4_2">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Method</th><th scope="col">flag</th><th scope="col">description</th></tr>
</thead>
<tbody>
<tr><td><code>string getName()</code></td><td></td><td>returns TaskContext name</td></tr>
<tr><td><code>bool start()</code></td><td></td><td>start TaskContext</td></tr>
<tr><td><code>bool stop()</code></td><td></td><td>stop TaskContext</td></tr>
<tr><td><code>bool configure()</code></td><td></td><td>configure TaskContext</td></tr>
<tr><td><code>bool activate()</code></td><td></td><td>activate TaskContext</td></tr>
<tr><td><code>bool cleanup()</code></td><td></td><td>cleanup TaskContext</td></tr>
<tr><td><code>string getState()</code></td><td></td><td>return string describing current state</td></tr>
<tr><td><code>table getPeers()</code></td><td></td><td>return a table of all peers</td></tr>
<tr><td><code>void addPeer(TaskContext)</code></td><td></td><td>add a TaskContext as a peer</td></tr>
<tr><td><code>void removePeer(string)</code></td><td></td><td>remove a peer</td></tr>
<tr><td><code>TaskContext getPeer(string)</code></td><td></td><td>get a peer</td></tr>
<tr><td><code>table getPortNames()</code></td><td></td><td>return a table of port names</td></tr>
<tr><td><code>void addPort(port)</code></td><td></td><td>add a port to TaskContext</td></tr>
<tr><td><code>void addEventPort(port)</code></td><td></td><td>add a port as an event driven port</td></tr>
<tr><td><code>Port getPort(string)</code></td><td></td><td>get a port with given name</td></tr>
<tr><td><code>addProperty(Property)</code></td><td></td><td>add a property to TaskContext</td></tr>
<tr><td><code>getProperty(string)</code></td><td></td><td>get a property with the given name</td></tr>
<tr><td><code>table getProperties()</code></td><td></td><td>return all properties in a table</td></tr>
<tr><td><code>table getOps()</code></td><td></td><td>return a table of Operation names</td></tr>
<tr><td><code>string, number string, table getOpInfo(string)</code></td><td></td><td>returns name, arity, description and table of argument descriptions</td></tr>
<tr><td><code>Service provides(...)</code></td><td></td><td>return service (provides/0 default, provides/1 subservice)</td></tr>
<tr><td><code>Variable call(string, ...)</code></td><td></td><td>call operation with name specified by string and right arguments</td></tr>
<tr><td><code>SendHandle send(string, ...)</code></td><td></td><td>as above but send. returns SendHandle</td></tr>
<tr><td><code>void delete(TaskContext)</code></td><td></td><td>explicit deletion of a TaskContext</td></tr>
</tbody>
</table>




</div>

</div>

<div id="outline-container-4_3" class="outline-3">
<h3 id="sec-4_3"><span class="section-number-3">4.3</span> <code>Variable</code> </h3>
<div class="outline-text-3" id="text-4_3">


</div>

</div>

<div id="outline-container-4_4" class="outline-3">
<h3 id="sec-4_4"><span class="section-number-3">4.4</span> <code>InputPort</code> and <code>OutputPort</code> </h3>
<div class="outline-text-3" id="text-4_4">


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Pitfalls </h2>
<div class="outline-text-2" id="text-5">

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> The <code>rttlib</code> convenience module </h2>
<div class="outline-text-2" id="text-6">

<p>This library adds some pretty printing functions to the standard
objects.
</p>
<p>
Todo: how add a custom pretty printer
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Tips and tricks </h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7_1" class="outline-3">
<h3 id="sec-7_1"><span class="section-number-3">7.1</span> Using functions instead of methods </h3>
<div class="outline-text-3" id="text-7_1">

</div>

</div>

<div id="outline-container-7_2" class="outline-3">
<h3 id="sec-7_2"><span class="section-number-3">7.2</span> rttlua init file <code>~/.rttlua</code> </h3>
<div class="outline-text-3" id="text-7_2">


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Known issues </h2>
<div class="outline-text-2" id="text-8">


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Todo  </h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9_1" class="outline-3">
<h3 id="sec-9_1"><span class="section-number-3">9.1</span> <span class="todo TODO"> TODO</span> reintegrate tlsf </h3>
<div class="outline-text-3" id="text-9_1">

</div>

</div>

<div id="outline-container-9_2" class="outline-3">
<h3 id="sec-9_2"><span class="section-number-3">9.2</span> <span class="todo TODO"> TODO</span> hard-real </h3>
<div class="outline-text-3" id="text-9_2">


</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> License </h2>
<div class="outline-text-2" id="text-10">


<p>
The Lua-RTT bindings are licensed under the LGPL.
</p></div>
</div>
<div id="postamble">
<p class="author"> Author: Markus Klotzbuecher
</p>
<p class="date"> Date: 2010-09-13 Mon</p>
<p class="creator">HTML generated by org-mode TAG=7.01g in emacs 23</p>
</div>
</div>
</body>
</html>
